# How do I remove columns from a pandas dataframe ?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Fri 27 Nov 2020

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.shape

(18241, 5)

In [5]:
ufo.drop('Colors Reported', axis=1, inplace=True)


‚≠êÔ∏è We use the method '.drop()' in which we stipulate the name of the column we wish to remove from our dataframe. 
The argument 'axis' spotted to 1 points towards the axis column. 
The second argument 'inplace' set to true as seen previously is guaranteed that our action performed by the method is recorded into our dataframe.

In [7]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00


‚úÖ The selected column was successfully dropped.


‚ûï We can also drop multiple columns at once using a list as see bellow.

In [9]:
ufo.drop(['State', 'City'], axis=1, inplace=True)

In [10]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00


‚úÖ Operation successfully achieved. Multiple columns removed.

# üé© Bonus tips : iPython | Jupyter Notebook ONLY

ü§† Let's assume you wish to remove rows rather than columns.


Let's see how we proceed :

‚≠êÔ∏è Rows are labelled by numbers as spotted above. We then refer to the rows we wish to remove by their numeric label. In this case the argument 'axis' corresponding to rows is '0'.

In [12]:
ufo.drop([0,1], axis=0, inplace=True)

In [13]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00


‚úÖ Operation successfully achieved. Two first rows removed.

In [15]:
ufo.shape

(18239, 2)

‚úÖ By using the '.shape' attribute, we notice that the two rows have been removed from the dataframe.

‚ùóÔ∏è The argument 'axis' is by default set to '0' towards the row. However and to be clear, it is better to mention it so that we avoid confusions.


üôèüèª Thank you !


üëãüèª See you in the next one !